axfnull/N32G401_CodeLib/firmware/n32g401f8s7_1_std_periph_driver/src/n32g401f8s7_1_spi.c
    /* Initialize the CLKPOL member */
    I2S_InitStruct->CLKPOL = I2S_CLKPOL_LOW;
}


/**
*\*\name    I2S_Initializes.
*\*\fun     Initializes the SPIx according to I2S_InitStruct.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\param   I2S_InitType :
*\*\          - I2sMode
*\*\           - I2S_MODE_SlAVE_TX 
*\*\           - I2S_MODE_SlAVE_RX 
*\*\           - I2S_MODE_MASTER_TX
*\*\           - I2S_MODE_MASTER_RX
*\*\          - Standard
*\*\           - I2S_STD_PHILLIPS      
*\*\           - I2S_STD_MSB_ALIGN     
*\*\           - I2S_STD_LSB_ALIGN     
*\*\           - I2S_STD_PCM_SHORTFRAME
*\*\           - I2S_STD_PCM_LONGFRAME 
*\*\          - DataFormat
*\*\           - I2S_DATA_FMT_16BITS          
*\*\           - I2S_DATA_FMT_16BITS_EXTENDED 
*\*\           - I2S_DATA_FMT_24BITS          
*\*\           - I2S_DATA_FMT_32BITS          
*\*\          - MCLKEnable
*\*\           - I2S_MCLK_ENABLE 
*\*\           - I2S_MCLK_DISABLE
*\*\          - AudioFrequency
*\*\           - I2S_AUDIO_FREQ_192K   
*\*\           - I2S_AUDIO_FREQ_96K    
*\*\           - I2S_AUDIO_FREQ_48K    
*\*\           - I2S_AUDIO_FREQ_44K    
*\*\           - I2S_AUDIO_FREQ_32K    
*\*\           - I2S_AUDIO_FREQ_22K    
*\*\           - I2S_AUDIO_FREQ_16K    
*\*\           - I2S_AUDIO_FREQ_11K    
*\*\           - I2S_AUDIO_FREQ_8K     
*\*\           - I2S_AUDIO_FREQ_DEFAULT
*\*\          - CLKPOL
*\*\           - I2S_CLKPOL_LOW 
*\*\           - I2S_CLKPOL_HIGH
*\*\return  none
**/
void I2S_Initializes(SPI_Module* SPIx, I2S_InitType* I2S_InitStruct)
{
    I2S_Mode_Config(SPIx, I2S_InitStruct->I2sMode);
    I2S_Standard_Config(SPIx, I2S_InitStruct->Standard);
    I2S_DataFormat_Config(SPIx, I2S_InitStruct->DataFormat);
    if(I2S_InitStruct->MCLKEnable == I2S_MCLK_ENABLE)
    {
        I2S_MCLK_Enable(SPIx);
    }
    else
    {
        I2S_MCLK_Disable(SPIx);
    }
    I2S_AudioFrequency_Config(SPIx,I2S_InitStruct->AudioFrequency);
    I2S_CLKPOL_Config(SPIx, I2S_InitStruct->CLKPOL);
}


/**
*\*\name    I2S_Mode_Config.
*\*\fun     Config the I2s I2sMode.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\param   I2sMode :
*\*\          - I2S_MODE_SlAVE_TX 
*\*\          - I2S_MODE_SlAVE_RX 
*\*\          - I2S_MODE_MASTER_TX
*\*\          - I2S_MODE_MASTER_RX
*\*\return  none
*\*\note    Must be used with I2S OFF.
**/
void I2S_Mode_Config(SPI_Module* SPIx, uint16_t I2sMode)
{
    /* Clear SPI_I2SCFG MODCFG bits */
    SPIx->I2SCFG &= I2S_MODE_MASK;
    /* Set SPI_I2SCFG MODCFG bits */
    SPIx->I2SCFG |= I2sMode;
}


/**
*\*\name    I2S_Standard_Config.
*\*\fun     Config the I2s Standard.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\param   I2sMode :
*\*\          - I2S_STD_PHILLIPS      
*\*\          - I2S_STD_MSB_ALIGN     
*\*\          - I2S_STD_LSB_ALIGN     
*\*\          - I2S_STD_PCM_SHORTFRAME
*\*\          - I2S_STD_PCM_LONGFRAME 
*\*\return  none
**/
void I2S_Standard_Config(SPI_Module* SPIx, uint16_t Standard)
{
    /* Clear SPI_I2SCFG STDSEL and PCMFSYNC bit */
    SPIx->I2SCFG &= I2S_STANDARD_MASK;
    /* Set SPI_I2SCFG STDSEL and PCMFSYNC bit */
    SPIx->I2SCFG |= Standard;
}


/**
*\*\name    I2S_DataFormat_Config.
*\*\fun     Config the I2s DataFormat.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\param   DataFormat :
*\*\          - I2S_DATA_FMT_16BITS          
*\*\          - I2S_DATA_FMT_16BITS_EXTENDED 
*\*\          - I2S_DATA_FMT_24BITS          
*\*\          - I2S_DATA_FMT_32BITS  
*\*\return  none
**/
void I2S_DataFormat_Config(SPI_Module* SPIx, uint16_t DataFormat)
{
    /* Clear SPI_I2SCFG CHBITS and TDATLEN bit */
    SPIx->I2SCFG &= I2S_DATA_FORMAT_MASK;
    /* Set SPI_I2SCFG CHBITS and TDATLEN bit */
    SPIx->I2SCFG |= DataFormat;
}


/**
*\*\name    I2S_MCLK_Enable.
*\*\fun     Enable the I2s MCLK.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\return  none
**/
void I2S_MCLK_Enable(SPI_Module* SPIx)
{
    /* Set SPI_I2SPREDIV MCLKOEN bit */
    SPIx->I2SPREDIV |= I2S_MCLK_ENABLE;
}


/**
*\*\name    I2S_MCLK_Disable.
*\*\fun     Disable the I2s MCLK.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\param   MCLKEnable :
*\*\return  none
**/
void I2S_MCLK_Disable(SPI_Module* SPIx)
{
    /* Clear SPI_I2SPREDIV MCLKOEN bit */
    SPIx->I2SPREDIV &= I2S_MCLK_DISABLE;
}


/**
*\*\name    I2S_Config_MCLKEnable_And_AudioFrequency.
*\*\fun     Config the I2s MCLKEnable and AudioFrequency.
*\*\param   SPIx :
*\*\          - SPI1
*\*\          - SPI2
*\*\param   AudioFrequency :
*\*\          - I2S_AUDIO_FREQ_192K   
*\*\          - I2S_AUDIO_FREQ_96K    
*\*\          - I2S_AUDIO_FREQ_48K    
*\*\          - I2S_AUDIO_FREQ_44K    
*\*\          - I2S_AUDIO_FREQ_32K    
*\*\          - I2S_AUDIO_FREQ_22K    
*\*\          - I2S_AUDIO_FREQ_16K    
*\*\          - I2S_AUDIO_FREQ_11K    
*\*\          - I2S_AUDIO_FREQ_8K     
*\*\          - I2S_AUDIO_FREQ_DEFAULT
*\*\return  none
**/
void I2S_AudioFrequency_Config(SPI_Module* SPIx, uint32_t AudioFrequency)
{
    uint16_t i2sdiv = 2, i2sodd = 0, packetlength = 1;
    uint32_t tmp = 0;///
    RCC_ClocksType RCC_Clocks;
    uint32_t sourceclock = 0;

    /* If the default value has to be written, reinitialize i2sdiv and i2sodd*/
    if (AudioFrequency == I2S_AUDIO_FREQ_DEFAULT)
    {
        i2sodd = (uint16_t)0;
        i2sdiv = (uint16_t)2;
    }
    else
    {
        /* Check the frame length (For the SPI_I2SCFG CHBITSbit) */
        if (SPIx->I2SCFG & SPI_I2SCFG_CHBITS)
        {
            /* Packet length is 32 bits */
            packetlength = 2;
        }
        else
        {
            /* Packet length is 16 bits */
            packetlength = 1;
        }
        
        /* I2S Clock source is System clock: Get System Clock frequency */
        RCC_Clocks_Frequencies_Value_Get(&RCC_Clocks); 

        /* Get the source clock value: based on System Clock value */
        sourceclock = RCC_Clocks.SysclkFreq;

        /* Compute the Real divider depending on the MCLK output state with a floating point */
        /* Get the SPIx->I2SPREDIV MCLKOEN bit state */
        if ( SPIx->I2SPREDIV & I2S_MCLK_ENABLE)
        {
            /* MCLK output is enabled */
            tmp = (uint16_t)(((((sourceclock / 256) * 10) / AudioFrequency)) + 5);
        }
        else
        {
            /* MCLK output is disabled */
            tmp = (uint16_t)(((((sourceclock / (32 * packetlength)) * 10) / AudioFrequency)) + 5);
        }

        /* Remove the floating point */
        tmp = tmp / 10;

        /* Check the parity of the divider */
        i2sodd = (uint16_t)(tmp & (uint16_t)0x0001);

        /* Compute the i2sdiv prescaler */
        i2sdiv = (uint16_t)((tmp - i2sodd) / 2);

